Revit 2016 API
FilteredElementIterator.Current Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual Element Current { get; }
Visual Basic
Public Overridable ReadOnly Property Current As Element
	Get
Visual C++
public:
virtual property Element^ Current {
	Element^ get ();
}
Implements
IEnumerator<T>.Current
See Also
FilteredElementIterator Class
Autodesk.Revit.DB Namespace